BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90USB162.PIC
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x100" edc:endaddr="0x300" edc:regionid="IRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1E9482"/>
  </edc:SignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="LOW" edc:factorydefault="0x5E" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SUT_CKSEL" edc:desc="Select Clock Source" edc:nzwidth="0x6">
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_0MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_4MS1" edc:desc="Ext. Clock; Start-up time: 6 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_65MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_0MS" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_4MS1" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_6CK_65MS" edc:desc="Int. RC Osc.; Start-up time: 6 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_0MS_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_4MS1_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_65MS_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_0MS_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_4MS1_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_65MS_INTCAP" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms; Int. Cap." edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_0MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_4MS1" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_65MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_0MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_4MS1" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_65MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_258CK_4MS1" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_258CK_65MS" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_1KCK_0MS" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_1KCK_4MS1" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_1KCK_65MS" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_16KCK_0MS" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_16KCK_4MS1" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ4_0MHZ9_16KCK_65MS" edc:desc="Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_258CK_4MS1" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_258CK_65MS" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1A"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_1KCK_0MS" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_1KCK_4MS1" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3A"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_1KCK_65MS" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_16KCK_0MS" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1B"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_16KCK_4MS1" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_0MHZ9_3MHZ_16KCK_65MS" edc:desc="Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3B"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_258CK_4MS1" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0C"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_258CK_65MS" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1C"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_1KCK_0MS" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_1KCK_4MS1" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3C"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_1KCK_65MS" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0D"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_16KCK_0MS" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1D"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_16KCK_4MS1" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_3MHZ_8MHZ_16KCK_65MS" edc:desc="Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3D"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_258CK_4MS1" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x0E"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_258CK_65MS" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 258 CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x1E"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_1KCK_0MS" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_1KCK_4MS1" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x3E"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_1KCK_65MS" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 1K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x0F"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_16KCK_0MS" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_16KCK_4MS1" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 4.1 ms" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:DCRFieldSemantic edc:cname="EXTXOSC_8MHZ_XX_16KCK_65MS" edc:desc="Ext. Crystal Osc. 8.0-    MHz; Start-up time: 16K CK + 65 ms" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKOUT" edc:desc="Clock output on PORTC7" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="CKDIV8" edc:desc="Divide clock by 8 internally" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="HIGH" edc:factorydefault="0xD9" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOOTRST" edc:desc="Boot Reset vector Enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTSZ" edc:desc="Select Boot Size" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="256W_1F00" edc:desc="Boot Flash size=256 words start address=$1F00" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="512W_1E00" edc:desc="Boot Flash size=512 words start address=$1E00" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="1024W_1C00" edc:desc="Boot Flash size=1024 words start address=$1C00" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="2048W_1800" edc:desc="Boot Flash size=2048 words start address=$1800" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watchdog timer always on" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="RSTDISBL" edc:desc="Reset Disabled (Enable PC6 as i/o pin)" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="DWEN" edc:desc="Debug Wire enable" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x2" edc:access="----nnnn" edc:cname="EXTENDED" edc:factorydefault="0xF4" edc:impl="0xF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brown-out Detector trigger level" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Brown-out detection disabled" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="2V7" edc:desc="Brown-out detection level at VCC=2.7 V" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="2V9" edc:desc="Brown-out detection level at VCC=2.9 V" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="3V0" edc:desc="Brown-out detection level at VCC=3.0 V" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="3V5" edc:desc="Brown-out detection level at VCC=3.5 V" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="3V6" edc:desc="Brown-out detection level at VCC=3.6 V" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="4V0" edc:desc="Brown-out detection level at VCC=4.0 V" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="4V3" edc:desc="Brown-out detection level at VCC=4.3 V" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HWBE" edc:desc="Hardware Boot Enable" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="--nnnnnn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0x3F" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB0" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Application Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Application Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BLB1" edc:desc="Boot Loader Protection Mode" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPM_SPM_DISABLE" edc:desc="LPM and SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="LPM_DISABLE" edc:desc="LPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="SPM_DISABLE" edc:desc="SPM prohibited in Boot Section" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No lock on SPM and LPM in Boot Section" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
</edc:PIC>